pschatzmann/ESP32-A2DP/src/BluetoothA2DPSink.h
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at

//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
//
// Copyright 2020 Phil Schatzmann
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD

#pragma once
#include "BluetoothA2DPCommon.h"
#if IS_VALID_PLATFORM

#include "BluetoothA2DPOutput.h"
#include "freertos/ringbuf.h"
#include "A2DPDecoder.h"

// Comment out next line to deactivate warnings
#ifndef A2DP_I2S_AUDIOTOOLS
#warning "AudioTools library is not included first or installed"
#endif

#define APP_SIG_WORK_DISPATCH (0x01)

#ifndef BT_AV_TAG
#define BT_AV_TAG "BT_AV"
#endif

#if (A2DP_SPP_SUPPORT && ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0))
#include "esp_spp_api.h"
#endif

#ifndef ESP_A2D_SBC_CIE_ALLOC_MTHD_SNR
#define ESP_A2D_SBC_CIE_ALLOC_MTHD_SNR (0x02)
#endif

/* @brief event for handler "bt_av_hdl_stack_up */
enum {
  BT_APP_EVT_STACK_UP = 0,
};

extern "C" void ccall_i2s_task_handler(void* arg);
extern "C" void ccall_audio_data_callback(const uint8_t* data, uint32_t len);
extern "C" void ccall_av_hdl_a2d_evt(uint16_t event, void* p_param);
extern "C" void ccall_av_hdl_avrc_evt(uint16_t event, void* p_param);
#if A2DP_MANAGED_DECODER_SUPPORTED
extern "C" void ccall_audio_managed_decode_callback(
    esp_a2d_conn_hdl_t conn_hdl, esp_a2d_audio_buff_t* audio_buf);
extern "C" void ccall_managed_decode_task_handler(void* arg);
#endif

/// defines the mechanism to confirm a pin request
enum PinCodeRequest { Undefined, Confirm, Reply };

// provide global ref for callbacks
class BluetoothA2DPSink;
extern BluetoothA2DPSink* actual_bluetooth_a2dp_sink;

/**
 * @brief BluetoothA2DPSink implements a robust, extensible A2DP Bluetooth audio
 * sink for ESP32.
 *
 * This class encapsulates the ESP-IDF A2DP sink example in a modern C++
 * interface, providing flexible audio output and advanced event handling.
 *
 * Key features:
 *   - Handles Bluetooth A2DP sink initialization, pairing, and connection
 * management
 *   - Supports output to I2S, Arduino Print, AudioTools, or custom output
 * classes
 *   - Provides callbacks for connection state, metadata, playback status,
 * volume changes, and raw audio data
 *   - Automatic reconnection logic with configurable retry count
 *   - AVRCP (remote control) support for playback and volume commands
 *   - RSSI (signal strength) reporting and peer device name retrieval
 *   - Optional managed multi-codec decoding via add_decoder() (ESP-IDF 5.5+)
 *   - Mono downmix, channel swap, and sample rate/channel introspection
 *   - Extensible for custom output, event handling, and platform integration
 *
 * Usage:
 *   - Instantiate BluetoothA2DPSink and call start() with a device name
 *   - Optionally configure output, callbacks, and reconnection behavior
 *   - Use provided methods to control playback, volume, and query connection
 * state
 *
 * For advanced buffering and task-based output, see BluetoothA2DPSinkQueued.
 *
 * @ingroup a2dp
 * @author Phil Schatzmann
 * @copyright Apache License Version 2
 */

class BluetoothA2DPSink : public BluetoothA2DPCommon {
  /// task hander for i2s
  friend void ccall_i2s_task_handler(void* arg);
  /// Callback for music stream
  friend void ccall_audio_data_callback(const uint8_t* data, uint32_t len);
  /// a2dp event handler
  friend void ccall_av_hdl_a2d_evt(uint16_t event, void* p_param);
  /// avrc event handler
  friend void ccall_av_hdl_avrc_evt(uint16_t event, void* p_param);
#if A2DP_MANAGED_DECODER_SUPPORTED
  friend void ccall_audio_managed_decode_callback(
      esp_a2d_conn_hdl_t conn_hdl, esp_a2d_audio_buff_t* audio_buf);
  friend void ccall_managed_decode_task_handler(void* arg);
  friend void a2dp_decoder_audio_info_changed(audio_tools::AudioInfo info);
#endif

 public:
  /// Default Constructor:  output via callback or Legacy I2S
  BluetoothA2DPSink();

  /// Define output scenario class
  BluetoothA2DPSink(BluetoothA2DPOutput& out) : BluetoothA2DPSink() {
    set_output(out);
  }

#if A2DP_I2S_AUDIOTOOLS
  /// Output AudioOutput using AudioTools library
  BluetoothA2DPSink(audio_tools::AudioOutput& output) : BluetoothA2DPSink() {
    set_output(output);
  }
  /// Output AudioStream using AudioTools library
  BluetoothA2DPSink(audio_tools::AudioStream& output) : BluetoothA2DPSink() {
    set_output(output);
  }
#endif

#ifdef ARDUINO
  /// Output to Arduino Print
  BluetoothA2DPSink(Print& output) : BluetoothA2DPSink() { set_output(output); }
#endif

  /// Destructor - stops the playback and releases all resources
  virtual ~BluetoothA2DPSink();

#if A2DP_LEGACY_I2S_SUPPORT
  /// Define the pins (Legacy I2S: OBSOLETE!)
  virtual void set_pin_config(i2s_pin_config_t pin_config) {
    out->set_pin_config(pin_config);
  }

  /// Define an alternative i2s port other then 0 (Legacy I2S: OBSOLETE!)
  virtual void set_i2s_port(i2s_port_t i2s_num) { out->set_i2s_port(i2s_num); }

  /// Define the i2s configuration (Legacy I2S: OBSOLETE!)
  virtual void set_i2s_config(i2s_config_t i2s_config) {
    out->set_i2s_config(i2s_config);
  }

  /// set output to I2S_CHANNEL_STEREO (default) or I2S_CHANNEL_MONO (Legacy
  /// I2S: OBSOLETE!)
  virtual void set_channels(i2s_channel_t channels) {
    set_mono_downmix(channels == I2S_CHANNEL_MONO);
  }

  /// Defines the bits per sample for output (if > 16 output will be expanded)
  /// (Legacy I2S: OBSOLETE!)
  virtual void set_bits_per_sample(int bps) { out->set_bits_per_sample(bps); }

#if ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 1, 1)
  virtual esp_err_t i2s_mclk_pin_select(const uint8_t pin) {
    return out->i2s_mclk_pin_select(pin);
  }
#endif

#endif

  /// Defines the output class: by default we use BluetoothA2DPOutputDefault
  void set_output(BluetoothA2DPOutput& output) { out = &output; }

