pschatzmann/ESP32-A2DP/src/BluetoothA2DPSink.h
  /// Provides access to the output class
  BluetoothA2DPOutput* get_output() { return out; }

#ifdef ARDUINO
  /// Output to Arduino Print
  void set_output(Print& output) {
    static BluetoothA2DPOutputPrint s_out;
    out = &s_out;
    out->set_output(output);
  }
#endif

#if A2DP_I2S_AUDIOTOOLS
  /// Output AudioOutput using AudioTools library
  void set_output(audio_tools::AudioOutput& output) { out->set_output(output); }
  /// Output AudioStream using AudioTools library
  void set_output(audio_tools::AudioStream& output) { out->set_output(output); }
#endif

  /// starts the I2S bluetooth sink with the inidicated name
  virtual void start(const char* name, bool auto_reconect);

  /// starts the I2S bluetooth sink with the inidicated name
  virtual void start(const char* name);

  /// ends the I2S bluetooth sink with the indicated name - if you release the
  /// memory a future start is not possible
  virtual void end(bool release_memory = false);

  /// Determine the actual audio type
  virtual esp_a2d_mct_t get_audio_type();

#if A2DP_MANAGED_DECODER_SUPPORTED
  /// Registers a decoder (e.g. A2DPDecoderSBC, A2DPDecoderAAC) that decodes
  /// the still-encoded frames delivered by the stack into PCM, which is
  /// then forwarded through the normal decoded-output pipeline (volume,
  /// stream_reader, write_audio) exactly like the built-in SBC path. Each
  /// added decoder registers its own stream endpoint - which codecs
  /// actually get negotiated depends entirely on what you've registered
  /// here plus what the connected source and ESP-IDF version support.
  /// Returns false if a decoder for that codec type is already registered.
  bool add_decoder(A2DPDecoder& decoder) { return audio_decoder.add_decoder(decoder); }

  /// MIME type of the currently selected/active decoder (e.g. "audio/sbc",
  /// "audio/aac"), or "" if none is active yet (e.g. before a source has
  /// connected and negotiated a codec)
  const char* mime() { return audio_decoder.mime(); }
#endif

  /// Define a callback method which provides connection state of AVRC service
  virtual void set_avrc_connection_state_callback(void (*callback)(bool)) {
    this->avrc_connection_state_callback = callback;
  }

  /// Define a callback method which provides the meta data
  virtual void set_avrc_metadata_callback(void (*callback)(uint8_t,
                                                           const uint8_t*)) {
    this->avrc_metadata_callback = callback;
  }

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
  /// Define a callback method which provides esp_avrc_playback_stat_t playback
  /// status notifications
  virtual void set_avrc_rn_playstatus_callback(
      void (*callback)(esp_avrc_playback_stat_t playback)) {
    this->avrc_rn_playstatus_callback = callback;
  }
  /// Define a callback method which provides esp_avrc_rn_param_t play position
  /// notifications, at a modifiable interval over 1s
  virtual void set_avrc_rn_play_pos_callback(
      void (*callback)(uint32_t play_pos), uint32_t notif_interval = 10) {
    this->avrc_rn_play_pos_callback = callback;
    this->notif_interval_s = std::max(notif_interval, (uint32_t)1);
  }
  /// Define a callback method which provides an 8bit array for track change
  /// notifications Typically the last bit is 1 when there is a track change (so
  /// can be cast to a uint8_t)
  virtual void set_avrc_rn_track_change_callback(
      void (*callback)(uint8_t* id)) {
    this->avrc_rn_track_change_callback = callback;
  }
#endif

  /// Defines the method which will be called with the sample rate is updated
  virtual void set_sample_rate_callback(void (*callback)(uint16_t rate)) {
    this->sample_rate_callback = callback;
  }

  /// Define callback which is called when we receive data: This callback
  /// provides access to the data
  virtual void set_stream_reader(void (*callBack)(const uint8_t*, uint32_t),
                                 bool i2s_output = true);

  /// Define a callback that is called before the volume changes: this callback
  /// provides access to the data
  virtual void set_raw_stream_reader(void (*callBack)(const uint8_t*,
                                                      uint32_t));

  /// Define callback which is called when we receive data
  virtual void set_on_data_received(void (*callBack)());

  /// Allows you to reject unauthorized addresses
  virtual void set_address_validator(
      bool (*callBack)(esp_bd_addr_t remote_bda)) {
    address_validator = callBack;
  }

  /// returns true if the avrc service is connected
  virtual bool is_avrc_connected();

  /// Changes the volume
  virtual void set_volume(uint8_t volume);

  /// Determines the volume
  virtual int get_volume();

  /// Set the callback that is called when they change the volume (kept for
  /// compatibility)
  virtual void set_on_volumechange(void (*callBack)(int));

  /// Set the callback that is called when remote changes the volume
  virtual void set_avrc_rn_volumechange(void (*callBack)(int));

  /// set the callback that the local volume change is notification is received
  /// and complete
  virtual void set_avrc_rn_volumechange_completed(void (*callBack)(int));

  /// Starts to play music using AVRC
  virtual void play();
  /// AVRC pause
  virtual void pause();
  /// AVRC stop
  virtual void stop();
  /// AVRC next
  virtual void next();
  /// AVRC previous
  virtual void previous();
  /// AVRC fast_forward
  virtual void fast_forward();
  /// AVRC rewind
  virtual void rewind();
  /// AVRC increase the volume
  virtual void volume_up();
  /// AVRC decrease the volume
  virtual void volume_down();

  /// mix stereo into single mono signal
  virtual void set_mono_downmix(bool enabled) {
    volume_control()->set_mono_downmix(enabled);
  }

  /// Provides the actually set data rate (in samples per second)
  virtual uint16_t sample_rate() { return m_sample_rate; }

  /// Provides the actually set number of channels (1=mono,2=stereo)
  virtual uint16_t channels() { return m_channels; }

