pschatzmann/ESP32-A2DP/src/BluetoothA2DPSink.h
  /// Set the callback called when there is a PIN request / confirmation
  virtual void set_on_pin_code_request(void (*callBack)(int));

  /// We need to confirm a new seesion by calling confirm_pin_code()
  virtual void activate_pin_code(bool active);

  /// confirms the connection request by returning the receivedn pin code
  virtual void confirm_pin_code();

  /// confirms the connection request by returning the indicated pin code
  virtual void confirm_pin_code(int code);

  /// provides the requested pin code (0 = undefined)
  virtual int pin_code() { return pin_code_int; }

  /// defines the requested metadata: eg. ESP_AVRC_MD_ATTR_TITLE |
  /// ESP_AVRC_MD_ATTR_ARTIST | ESP_AVRC_MD_ATTR_ALBUM |
  /// ESP_AVRC_MD_ATTR_TRACK_NUM | ESP_AVRC_MD_ATTR_NUM_TRACKS |
  /// ESP_AVRC_MD_ATTR_GENRE | ESP_AVRC_MD_ATTR_PLAYING_TIME
  virtual void set_avrc_metadata_attribute_mask(int flags) {
    avrc_metadata_flags = flags;
  }

  /// swaps the left and right channel
  virtual void set_swap_lr_channels(bool swap) { swap_left_right = swap; }

  /// Defines the number of times that the system tries to automatically
  /// reconnect to the last system
  virtual void set_auto_reconnect(bool reconnect,
                                  int count = AUTOCONNECT_TRY_NUM) {
    reconnect_status = reconnect ? AutoReconnect : NoReconnect;
    try_reconnect_max_count = count;
  }

  /// Provides the address of the connected device
  virtual esp_bd_addr_t* get_current_peer_address() { return &peer_bd_addr; }

  /// Activates the rssi reporting
  void set_rssi_active(bool active) { rssi_active = active; }

  /// Requests an update of the rssi delta value
  bool update_rssi() {
    if (!rssi_active) return false;
    return esp_bt_gap_read_rssi_delta(*get_current_peer_address()) == ESP_OK;
  }

  /// provides the last rssi parameters
  esp_bt_gap_cb_param_t::read_rssi_delta_param get_last_rssi() {
    return last_rssi_delta;
  }

  /// Defines the callback that is called when we get an new rssi value
  void set_rssi_callback(
      void (*callback)(esp_bt_gap_cb_param_t::read_rssi_delta_param& rssi)) {
    rssi_callback = callback;
  }

  /// Defines the callback that is called when we get the peer name
  void set_peer_name_callback(void (*callback)(char* peer_name)) {
    peer_name_callback = callback;
  }

  /// Defines the delay that is added to delay the startup when we automatically
  /// reconnect
  void set_reconnect_delay(int delay) { reconnect_delay = delay; }

#if A2DP_SPP_SUPPORT
  /// Activates SSP (Serial protocol)
  void set_spp_active(bool flag) { spp_active = flag; }

#if (ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0))
  /// Set SPP configuration (only before start)
  void set_spp_config(esp_spp_cfg_t cfg) { spp_cfg = cfg; }
#endif
#endif

  /// Activate/Deactivate output e.g. to I2S
  void set_output_active(bool flag) { is_i2s_active = flag; }

  /// Automatically deactivates output when state is suspended 
  void set_output_active_by_state(bool active) { is_output_active_by_state = active;}

  /// Checks if output is active
  bool is_output_active() { return is_i2s_active; }

  /// defines the max write size: default is A2DP_I2S_MAX_WRITE_SIZE
  void set_max_write_size(int size) { max_write_size = size; }

  /// defines a small delay after each write: default is 0 ms
  void set_max_write_delay_ms(int delay) { max_write_delay_ms = delay; }

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
  /// Provides the result of the last result for the
  /// esp_avrc_tg_get_rn_evt_cap() callback (Available from ESP_IDF_4)
  bool is_avrc_peer_rn_cap(esp_avrc_rn_event_ids_t cmd) {
    return esp_avrc_rn_evt_bit_mask_operation(ESP_AVRC_BIT_MASK_OP_TEST,
                                              &s_avrc_peer_rn_cap, cmd);
  }
  /// Returns true if the is_avrc_peer_rn_cap() method can be called
  bool is_avrc_peer_rn_cap_available() { return s_avrc_peer_rn_cap.bits != 0; }

  /// Get the name of the connected source device
  virtual const char* get_peer_name() { return get_connected_source_name(); }

#endif

 protected:
  BluetoothA2DPOutputDefault out_default;
  BluetoothA2DPOutput* out = &out_default;

  volatile bool is_i2s_active = false;
  // activate output via BluetoothA2DPOutput
  bool is_output = true;
  bool is_output_active_by_state = true;
  uint16_t m_sample_rate = 44100;  // set default rate
  // number of PCM channels negotiated (1=mono,2=stereo). Default 2.
  uint8_t m_channels = 2;
  uint32_t m_pkt_cnt = 0;
  // esp_a2d_audio_state_t m_audio_state = ESP_A2D_AUDIO_STATE_STOPPED;
  esp_a2d_mct_t audio_type;
  char pin_code_str[20] = {0};
  int connection_rety_count = 0;
#if A2DP_SPP_SUPPORT
  bool spp_active = false;
#if (ESP_IDF_VERSION < ESP_IDF_VERSION_VAL(5, 0, 0))
  esp_spp_mode_t esp_spp_mode = ESP_SPP_MODE_CB;
#else
  esp_spp_cfg_t spp_cfg = BT_SPP_DEFAULT_CONFIG();
#endif
#endif
  _lock_t s_volume_lock;
  uint8_t s_volume = 0;
  bool s_volume_notify;
  int pin_code_int = 0;
  PinCodeRequest pin_code_request = Undefined;
  bool is_pin_code_active = false;
  bool avrc_connection_state = false;
  int avrc_metadata_flags =
      ESP_AVRC_MD_ATTR_TITLE | ESP_AVRC_MD_ATTR_ARTIST |
      ESP_AVRC_MD_ATTR_ALBUM | ESP_AVRC_MD_ATTR_TRACK_NUM |
      ESP_AVRC_MD_ATTR_NUM_TRACKS | ESP_AVRC_MD_ATTR_GENRE;
  void (*bt_volumechange)(int) = nullptr;
  void (*bt_dis_connected)() = nullptr;
  void (*bt_connected)() = nullptr;
  void (*pin_code_request_callback)(int) = nullptr;
  void (*data_received)() = nullptr;
  void (*stream_reader)(const uint8_t*, uint32_t) = nullptr;
  void (*raw_stream_reader)(const uint8_t*, uint32_t) = nullptr;
  void (*avrc_connection_state_callback)(bool connected) = nullptr;
  void (*avrc_metadata_callback)(uint8_t, const uint8_t*) = nullptr;
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
  void (*avrc_rn_playstatus_callback)(esp_avrc_playback_stat_t) = nullptr;
  void (*avrc_rn_track_change_callback)(uint8_t*) = nullptr;
  void (*avrc_rn_play_pos_callback)(uint32_t) = nullptr;
  uint32_t notif_interval_s = 10;
#endif
  void (*avrc_rn_volchg_complete_callback)(int) = nullptr;
  bool (*address_validator)(esp_bd_addr_t remote_bda) = nullptr;
  void (*sample_rate_callback)(uint16_t rate) = nullptr;
  bool swap_left_right = false;
  int try_reconnect_max_count = AUTOCONNECT_TRY_NUM;

  // RSSI support
  esp_bt_gap_cb_param_t::read_rssi_delta_param last_rssi_delta;
  bool rssi_active = false;
  void (*rssi_callback)(esp_bt_gap_cb_param_t::read_rssi_delta_param& rssi) =
      nullptr;
  void (*peer_name_callback)(char* peer_name) = nullptr;
  int reconnect_delay = 1000;
  int max_write_size = A2DP_I2S_MAX_WRITE_SIZE;
  int max_write_delay_ms = A2DP_I2S_MAX_WRITE_DELAY_MS;

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
  esp_avrc_rn_evt_cap_mask_t s_avrc_peer_rn_cap = {0};
  char remote_name[ESP_BT_GAP_MAX_BDNAME_LEN + 1];
#endif
#if A2DP_MANAGED_DECODER_SUPPORTED
  // registers a stream endpoint per decoder added via add_decoder() and
  // decodes whichever codec the source negotiates into PCM, transparently
  // to the app, using audio_tools decoders (see A2DPDecoder.h)
  A2DPAudioDecoder audio_decoder;
  QueueHandle_t codec_raw_queue = nullptr;
  TaskHandle_t codec_decode_task_handle = nullptr;
  /// true when the managed decode path should be used instead of the
  /// legacy decoded-only path: requires at least one decoder to have been
  /// registered via add_decoder()
  bool use_managed_decoder() { return audio_decoder.has_decoders(); }
#endif

  void app_gap_callback(esp_bt_gap_cb_event_t event,
                        esp_bt_gap_cb_param_t* param) override;
  void app_rc_ct_callback(esp_avrc_ct_cb_event_t event,
                          esp_avrc_ct_cb_param_t* param) override;
  void app_a2d_callback(esp_a2d_cb_event_t event,
                        esp_a2d_cb_param_t* param) override;
  void av_hdl_stack_evt(uint16_t event, void* p_param) override;

  virtual int init_bluetooth();
  virtual bool app_work_dispatch(app_callback_t p_cback, uint16_t event,
                                 void* p_params, int param_len);
  virtual void app_alloc_meta_buffer(esp_avrc_ct_cb_param_t* param);
  virtual void av_new_track();
  virtual void av_playback_changed();
  virtual void av_play_pos_changed();
  // execute AVRC command
  virtual void execute_avrc_command(int cmd);

