pschatzmann/ESP32-A2DP/src/BluetoothA2DPSink.h
  virtual const char* last_bda_nvs_name() { return "last_bda"; }

  virtual bool is_reconnect(esp_a2d_disc_rsn_t type) {
    bool result = is_autoreconnect_allowed &&
                  (reconnect_status == AutoReconnect ||
                   reconnect_status == IsReconnecting) &&
                  has_last_connection();
    ESP_LOGI(BT_AV_TAG, "is_reconnect: %s", result ? "true" : "false");
    return result;
  }

  /**
   * Wrappbed methods called from callbacks
   */
  // Callback for music stream
  virtual void audio_data_callback(const uint8_t* data, uint32_t len);
  // a2dp event handler
  virtual void av_hdl_a2d_evt(uint16_t event, void* p_param);
  // avrc event handler
  virtual void av_hdl_avrc_evt(uint16_t event, void* p_param);

  // split up long handlers
  virtual void handle_connection_state(uint16_t event, void* p_param);
  virtual void handle_audio_state(uint16_t event, void* p_param);
  virtual void handle_audio_cfg(uint16_t event, void* p_param);
  virtual void handle_avrc_connection_state(bool connected);
  /// updates m_sample_rate/m_channels, notifies sample_rate_callback and
  /// the output - shared by the legacy SBC-only path (handle_audio_cfg)
  /// and the managed decoder path (managed_decode_task_handler)
  virtual void apply_audio_info(int sample_rate, int channels);
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 5, 0)
  virtual void handle_sep_reg_state(uint16_t event, void* p_param);
#endif

#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(4, 0, 0)
  /// Get the name of the connected source device (obsolete): use
  /// get_peer_name()
  virtual const char* get_connected_source_name();
  virtual void volume_set_by_local_host(uint8_t volume);
  virtual void volume_set_by_controller(uint8_t volume);
  virtual void av_notify_evt_handler(uint8_t event_id,
                                     esp_avrc_rn_param_t* event_parameter);
  virtual void app_rc_tg_callback(esp_avrc_tg_cb_event_t event,
                                  esp_avrc_tg_cb_param_t* param) override;
  virtual void av_hdl_avrc_tg_evt(uint16_t event, void* p_param) override;
#else
  virtual void av_notify_evt_handler(uint8_t event_id,
                                     uint32_t event_parameter);
#endif

  virtual void init_i2s();

  /// output audio data e.g. to i2s or to queue
  virtual size_t write_audio(const uint8_t* data, size_t size) {
    return i2s_write_data(data, size);
  }

  /// writes the data to i2s
  size_t i2s_write_data(const uint8_t* data, size_t item_size);

  /// dummy functions needed for BluetoothA2DPSinkQueued
  virtual void i2s_task_handler(void* arg) {}
  virtual void bt_i2s_task_start_up(void) {}
  virtual void bt_i2s_task_shut_down(void) {}

#if A2DP_MANAGED_DECODER_SUPPORTED
  /// registers one stream endpoint per decoder added via add_decoder() and
  /// the raw-frame callback, called from av_hdl_stack_evt() when
  /// use_managed_decoder()
  virtual void register_managed_decoder_seps();
  /// creates the raw queue + decode task, called on ESP_A2D_AUDIO_STATE_STARTED
  virtual void managed_decode_start();
  /// suspends the decode task, drains the raw queue and closes the decoder,
  /// called on ESP_A2D_AUDIO_STATE_SUSPEND / disconnect
  virtual void managed_decode_flush();
  /// task loop: pulls raw encoded buffers off codec_raw_queue and decodes them
  virtual void managed_decode_task_handler(void* arg);
#endif

  esp_err_t esp_a2d_connect(esp_bd_addr_t peer) override {
    return esp_a2d_sink_connect(peer);
  }
  esp_err_t esp_a2d_disconnect(esp_bd_addr_t remote_bda) override {
    return esp_a2d_sink_disconnect(remote_bda);
  }

  void set_scan_mode_connectable_default() override {
    set_scan_mode_connectable(true);
  }

  virtual void set_i2s_active(bool active);

  virtual bool isSource() { return false; }
};

#endif  // platform
